In [56]:
import pandas as pd
import numpy as np

In [16]:
s = pd.Series([10,2,3,4])
s

0    10
1     2
2     3
3     4
dtype: int64

In [4]:
s.dtype

dtype('float64')

In [5]:
s.values

array([10.2,  3. ,  4. ])

In [6]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [20]:
s.name = 'Calories'

In [9]:
s

0    10.2
1     3.0
2     4.0
Name: Numbers, dtype: float64

In [10]:
s[0]

np.float64(10.2)

In [11]:
s[0:2] # ending is not included

0    10.2
1     3.0
Name: Numbers, dtype: float64

In [13]:
s.iloc[2]

np.float64(4.0)

In [15]:
s.iloc[[1,2]]

1    3.0
2    4.0
Name: Numbers, dtype: float64

In [17]:
index = ['apple', 'mango', 'orange', 'grapes']

In [22]:
s.index=index
s

apple     10
mango      2
orange     3
grapes     4
Name: Calories, dtype: int64

In [23]:
s['grapes']

np.int64(4)

In [27]:
s.loc['mango':'grapes'] # ending is included

mango     2
orange    3
grapes    4
Name: Calories, dtype: int64

In [28]:
s.loc[['grapes','apple']]

grapes     4
apple     10
Name: Calories, dtype: int64

In [29]:
fruits_protein = {
    'avakado':2.0,
    'guava':2.6,
    'blackberies':2.0,
    'oranges':0.9,
    'banana':1.1,
    'apple':1.3,
    'kivi':1.1,
    'pomogranate':1.7,
    'mango':.8,
    'cheries':1
}

In [32]:
s2 = pd.Series(fruits_protein,name='protein')
s2

avakado        2.0
guava          2.6
blackberies    2.0
oranges        0.9
banana         1.1
apple          1.3
kivi           1.1
pomogranate    1.7
mango          0.8
cheries        1.0
Name: protein, dtype: float64

In [37]:
s2[(s2>1) & (s2<=2)]

avakado        2.0
blackberies    2.0
banana         1.1
apple          1.3
kivi           1.1
pomogranate    1.7
Name: protein, dtype: float64

In [57]:
data ={
    'name':['ajay','ram','sam','gopi','vinay'],
    'age':[20,25,np.nan,24,30],
    'department':['HR','IT','Finance','IT','HR'],
    'salary':[65000,50000,90000,99000,np.nan]
}

In [39]:
data

{'name': ['ajay', 'ram', 'sam', 'gopi', 'vinay'],
 'age': [20, 25, 23, 24, 30],
 'department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
 'salary': [65000, 50000, 90000, 99000, 40000]}

In [58]:
df = pd.DataFrame(data)

In [59]:
df

    name   age department   salary
0   ajay  20.0         HR  65000.0
1    ram  25.0         IT  50000.0
2    sam   NaN    Finance  90000.0
3   gopi  24.0         IT  99000.0
4  vinay  30.0         HR      NaN

In [42]:
df.head()

    name  age department  salary
0   ajay   20         HR   65000
1    ram   25         IT   50000
2    sam   23    Finance   90000
3   gopi   24         IT   99000
4  vinay   30         HR   40000

In [44]:
df.tail(3)

    name  age department  salary
2    sam   23    Finance   90000
3   gopi   24         IT   99000
4  vinay   30         HR   40000

In [45]:
df.iloc[1:2]

  name  age department  salary
1  ram   25         IT   50000

In [47]:
df.loc[1:3,['age','department']]

   age department
1   25         IT
2   23    Finance
3   24         IT

In [60]:
df.drop('age',axis=1)

    name department   salary
0   ajay         HR  65000.0
1    ram         IT  50000.0
2    sam    Finance  90000.0
3   gopi         IT  99000.0
4  vinay         HR      NaN

In [61]:
df

    name   age department   salary
0   ajay  20.0         HR  65000.0
1    ram  25.0         IT  50000.0
2    sam   NaN    Finance  90000.0
3   gopi  24.0         IT  99000.0
4  vinay  30.0         HR      NaN

In [62]:
df.shape

(5, 4)

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        5 non-null      object
 1   age         4 non-null      float64
 2   department  5 non-null      object
 3   salary      4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [65]:
df.describe()

             age        salary
count   4.000000      4.000000
mean   24.750000  76000.000000
std     4.112988  22524.061209
min    20.000000  50000.000000
25%    23.000000  61250.000000
50%    24.500000  77500.000000
75%    26.250000  92250.000000
max    30.000000  99000.000000